# PANDAS

This notebook is about pandas notes

Pandas is mainly used for data analysis.
Pandas allows importing data from various file formats such as comma-separated values, JSON, SQL, Microsoft Excel.
Pandas allows various data manipulation operations such as merging, reshaping, selecting, as well as data cleaning.
Credit : https://en.wikipedia.org/wiki/Pandas_(software)

In [1]:
import pandas as pd
import numpy as np

## Series

We can convert list, numpy array, and dictionary to series

In [2]:
lst = ['A','B','C','D','E','F','G','H','I']
series = pd.Series(lst)
series.values

array(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'], dtype=object)

In [3]:
series

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
dtype: object

type, head, tail, dtype

In [4]:
type(series)

pandas.core.series.Series

In [5]:
series.head(5)

0    A
1    B
2    C
3    D
4    E
dtype: object

In [79]:
series.tail(2)

7    H
8    I
dtype: object

In [80]:
series.dtype

dtype('O')

In [81]:
# Let's do that the same procedure with an array
arr = np.arange(1,10)
pd.Series(data = lst, index =arr)

1    A
2    B
3    C
4    D
5    E
6    F
7    G
8    H
9    I
dtype: object

In [82]:
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [83]:
dict = {'a': 1, 'b': 2, 'c': 3, 'd': 4,'e': 5}
dict

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [84]:
pd.Series(dict)

a    1
b    2
c    3
d    4
e    5
dtype: int64

# Naming Indexes

In [85]:
ser1 = pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
ser1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [86]:
ser1['a':'d']

a    10
b    20
c    30
d    40
dtype: int64

In [87]:
ser1['a'] =25
ser1

a    25
b    20
c    30
d    40
e    50
dtype: int64

In [88]:
ser2 = pd.Series([15,25,35,45,55], index = ['a','k','l','d','c'])
ser2

a    15
k    25
l    35
d    45
c    55
dtype: int64

In [89]:
# we can add two series 
ser1 +ser2

a    40.0
b     NaN
c    85.0
d    85.0
e     NaN
k     NaN
l     NaN
dtype: float64

## Concatenation Two Series

In [90]:
pd.concat([ser1,ser2])

a    25
b    20
c    30
d    40
e    50
a    15
k    25
l    35
d    45
c    55
dtype: int64

# Data Frames

In [91]:
from numpy.random import randn # Return a sample (or samples) from the “standard normal” distribution.
df = pd.DataFrame(randn(4,5), index=[1,2,3,4], columns = ['A','B','C','D','E'])
df

          A         B         C         D         E
1  1.244445 -0.711677  0.898524 -0.831312 -0.949344
2 -1.319902  2.523816 -0.111846  1.415702  0.499198
3  0.679608  1.306794  0.132995  0.947167 -1.062131
4 -0.312171 -0.098641 -0.344904 -0.429925 -2.189258

In [19]:
df['C']

1   -0.081447
2    0.487654
3    0.688628
4    0.429225
Name: C, dtype: float64

In [20]:
df.head(2)

          A         B         C         D         E
1  0.026119  1.457695 -0.081447  1.714330  0.864060
2 -0.008218  1.930645  0.487654  1.970498  0.660884

In [21]:
df[['A','E']]

          A         E
1  0.026119  0.864060
2 -0.008218  0.660884
3 -0.482228  0.870453
4 -1.297033 -1.296972

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
type(df['A'])

pandas.core.series.Series

In [24]:
df['new'] = df['A'] + df['D']
df

          A         B         C         D         E       new
1  0.026119  1.457695 -0.081447  1.714330  0.864060  1.740449
2 -0.008218  1.930645  0.487654  1.970498  0.660884  1.962281
3 -0.482228  1.293338  0.688628 -0.054998  0.870453 -0.537226
4 -1.297033  0.094428  0.429225 -0.434594 -1.296972 -1.731627

In [25]:
df.drop('A', axis=1)

          B         C         D         E       new
1  1.457695 -0.081447  1.714330  0.864060  1.740449
2  1.930645  0.487654  1.970498  0.660884  1.962281
3  1.293338  0.688628 -0.054998  0.870453 -0.537226
4  0.094428  0.429225 -0.434594 -1.296972 -1.731627

In [26]:
df

          A         B         C         D         E       new
1  0.026119  1.457695 -0.081447  1.714330  0.864060  1.740449
2 -0.008218  1.930645  0.487654  1.970498  0.660884  1.962281
3 -0.482228  1.293338  0.688628 -0.054998  0.870453 -0.537226
4 -1.297033  0.094428  0.429225 -0.434594 -1.296972 -1.731627

In [27]:
df.drop('A', axis=1, inplace=True) # if we want remove 'A' we should use inplace=True
df

          B         C         D         E       new
1  1.457695 -0.081447  1.714330  0.864060  1.740449
2  1.930645  0.487654  1.970498  0.660884  1.962281
3  1.293338  0.688628 -0.054998  0.870453 -0.537226
4  0.094428  0.429225 -0.434594 -1.296972 -1.731627

In [28]:
# if we want to delete a row 
df.drop(4, axis=0)

          B         C         D         E       new
1  1.457695 -0.081447  1.714330  0.864060  1.740449
2  1.930645  0.487654  1.970498  0.660884  1.962281
3  1.293338  0.688628 -0.054998  0.870453 -0.537226

In [29]:
df[df['B']>0.6]

          B         C         D         E       new
1  1.457695 -0.081447  1.714330  0.864060  1.740449
2  1.930645  0.487654  1.970498  0.660884  1.962281
3  1.293338  0.688628 -0.054998  0.870453 -0.537226

In [30]:
df[df['B']>0][['D','E']]

          D         E
1  1.714330  0.864060
2  1.970498  0.660884
3 -0.054998  0.870453
4 -0.434594 -1.296972

In [31]:
df

          B         C         D         E       new
1  1.457695 -0.081447  1.714330  0.864060  1.740449
2  1.930645  0.487654  1.970498  0.660884  1.962281
3  1.293338  0.688628 -0.054998  0.870453 -0.537226
4  0.094428  0.429225 -0.434594 -1.296972 -1.731627

## More Indexing

In [32]:
df['country'] = ['Turkey','Greece','Canada','Argentina']
df

          B         C         D         E       new    country
1  1.457695 -0.081447  1.714330  0.864060  1.740449     Turkey
2  1.930645  0.487654  1.970498  0.660884  1.962281     Greece
3  1.293338  0.688628 -0.054998  0.870453 -0.537226     Canada
4  0.094428  0.429225 -0.434594 -1.296972 -1.731627  Argentina

In [33]:
df.set_index('country')

                  B         C         D         E       new
country
Turkey     1.457695 -0.081447  1.714330  0.864060  1.740449
Greece     1.930645  0.487654  1.970498  0.660884  1.962281
Canada     1.293338  0.688628 -0.054998  0.870453 -0.537226
Argentina  0.094428  0.429225 -0.434594 -1.296972 -1.731627

In [34]:
df

          B         C         D         E       new    country
1  1.457695 -0.081447  1.714330  0.864060  1.740449     Turkey
2  1.930645  0.487654  1.970498  0.660884  1.962281     Greece
3  1.293338  0.688628 -0.054998  0.870453 -0.537226     Canada
4  0.094428  0.429225 -0.434594 -1.296972 -1.731627  Argentina

## Multi Indexing

In [37]:
# index levels
outside = ['J1','J1','J1','J2','J2','J2']
inside = [1,2,3,1,2,3]
indexing = list(zip(outside,inside))
indexing = pd.MultiIndex.from_tuples(indexing)

In [44]:
datafrm = pd.DataFrame(np.random.randn(6,2),index= indexing,columns=['A','B'])
datafrm

             A         B
J1 1 -1.983308 -2.224140
   2  0.080458  0.149654
   3  0.555666  0.670641
J2 1  0.529266  0.931514
   2 -1.524199 -0.699925
   3 -1.375512  1.484654

In [52]:
datafrm.loc['J2'][1:3]

          A         B
2 -1.524199 -0.699925
3 -1.375512  1.484654

## Missing Data

This part plays important role in data analysis

In [60]:
new = pd.DataFrame({'X':[12,23, np.nan,44],
                   'Y': [11,np.nan,34,2],
                   'Z': [15,35, 42,21],
                   'T': [54, 90,14,np.nan]})
new

      X     Y   Z     T
0  12.0  11.0  15  54.0
1  23.0   NaN  35  90.0
2   NaN  34.0  42  14.0
3  44.0   2.0  21   NaN

In [63]:
new.dropna() # if we don't write anything it takes axis=0

      X     Y   Z     T
0  12.0  11.0  15  54.0

In [64]:
new.dropna(axis=1)

    Z
0  15
1  35
2  42
3  21

In [69]:
new.mean()

X    26.333333
Y    15.666667
Z    28.250000
T    52.666667
dtype: float64

In [77]:
new['Y'].fillna(value = new['Y'].mean(), inplace=True)

In [78]:
new

      X          Y   Z     T
0  12.0  11.000000  15  54.0
1  23.0  15.666667  35  90.0
2   NaN  34.000000  42  14.0
3  44.0   2.000000  21   NaN

## Grouping

In [95]:
# Create dataframe
data = {'Company':['AMAZON','AMAZON','MSFT','MSFT','IBM','IBM'],
       'Person':['Alice','Charlie','Amy','Joey','Carl','Sarah'],
       'Sales':[350,150,390,148,248,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0  AMAZON    Alice    350
1  AMAZON  Charlie    150
2    MSFT      Amy    390
3    MSFT     Joey    148
4     IBM     Carl    248
5     IBM    Sarah    350

In [102]:
# Let' group the companies
by_company = df.groupby('Company')
by_company

In [103]:
# After grouping we can use aggregation on it : mean, max, min ,count, std etc
by_company.mean()

         Sales
Company
AMAZON     250
IBM        299
MSFT       269

In [104]:
by_company.std()

              Sales
Company
AMAZON   141.421356
IBM       72.124892
MSFT     171.119841

In [105]:
by_company.min()

        Person  Sales
Company
AMAZON   Alice    150
IBM       Carl    248
MSFT       Amy    148

In [106]:
by_company.max()

          Person  Sales
Company
AMAZON   Charlie    350
IBM        Sarah    350
MSFT        Joey    390

In [107]:
by_company.count()

         Person  Sales
Company
AMAZON        2      2
IBM           2      2
MSFT          2      2

In [108]:
by_company.describe().T

Company          AMAZON         IBM        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   250.000000  299.000000  269.000000
      std    141.421356   72.124892  171.119841
      min    150.000000  248.000000  148.000000
      25%    200.000000  273.500000  208.500000
      50%    250.000000  299.000000  269.000000
      75%    300.000000  324.500000  329.500000
      max    350.000000  350.000000  390.000000

## Merging

In [111]:
first_Data =pd.DataFrame({'X': ['X0','X1','X2','X3','X4'],
              'Y': ['Y0','Y1','Y2','Y3','Y4'],
              'key': ['key0','key1','key2','key3','key4']  
})
first_Data

    X   Y   key
0  X0  Y0  key0
1  X1  Y1  key1
2  X2  Y2  key2
3  X3  Y3  key3
4  X4  Y4  key4

In [112]:
second_Data =pd.DataFrame({'T': ['T0','T1','T2','T3','T4'],
              'W': ['W0','W1','W2','W3','W4'],
              'key': ['key0','key1','key2','key3','key4']  
})
second_Data

    T   W   key
0  T0  W0  key0
1  T1  W1  key1
2  T2  W2  key2
3  T3  W3  key3
4  T4  W4  key4

In [130]:
# merging method similar join method in SQL.
# we are merging two dataframe on their same column
MERGED = pd.merge(first_Data, second_Data, how='inner', on='key')
MERGED

    X   Y   key   T   W
0  X0  Y0  key0  T0  W0
1  X1  Y1  key1  T1  W1
2  X2  Y2  key2  T2  W2
3  X3  Y3  key3  T3  W3
4  X4  Y4  key4  T4  W4